posts/2016-01-30-dancing-before-god.org
#+date: <2016-01-30>
#+filetags: prayer religion
#+title: Dancing Before God

After reflecting on my time dancing during the service at Koinonia Baptist Church in Tamale, Ghana. There are pictures, there might even be some video.

God of joy,

Forgive me for the many times\\
when what others were thinking\\
was more important to me\\
than expressing my praise to you.

Remove any inhibition\\
that stands in my way,\\
and may my heart be\\
so filled with joy\\
that I cannot help\\
but to dance\\
before the throne of God.

Amen
